app/Models/ModelAuth.php

SELECT *
FROM `tb_user`
WHERE `email` = 'refan123@gmail.com'
AND `password` = 'Refan Fad'
---
    public function LoginUser($email, $password){
        return $this->db->table('tb_user')
        ->where([
            'email' => $email,
            'password' => $password,
        ])->get()->getRowArray();

SELECT *
FROM `tb_user`
WHERE `username` = 'ahmad12'
AND `password` = '12345'
---
    public function LoginAnggota($username, $password){
        return $this->db->table('tb_user')
        ->where([
            'username' => $username,
            'password' => $password,
        ])->get()->getRowArray();