app/Models/ModelBuku.php

SELECT *
FROM `tb_buku`
LEFT JOIN `tb_penulis` ON `tb_penulis`.`id` = `tb_buku`.`penulis_id`
LEFT JOIN `tb_penerbit` ON `tb_penerbit`.`id` = `tb_buku`.`penerbit_id`
LEFT JOIN `tb_kategori` ON `tb_kategori`.`id` = `tb_buku`.`kategori_id`
---
    public function AllData()
    {
        return $this->db->table('tb_buku')
        ->join('tb_penulis', 'tb_penulis.id = tb_buku.penulis_id', 'left')
        ->join('tb_penerbit', 'tb_penerbit.id = tb_buku.penerbit_id', 'left')
        ->join('tb_kategori', 'tb_kategori.id = tb_buku.kategori_id', 'left')
        ->get()->getResultArray();

INSERT INTO `tb_buku` (`judul`, `penulis_id`, `kategori_id`, `penerbit_id`, `jumlah`, `tahun`, `lokasi`, `foto_buku`) VALUES ('jalaludin rumi', '2', '3', '3', '20', '2003', 'rak 6', '1716606464_f190f902e4a11fca9009.jpeg')
---
    public function TambahBuku($data)
    {
        unset($data['id']);
        $this->db->table('tb_buku')->insert($data);

DELETE FROM `tb_buku`
WHERE `id` = '2'
AND `id` = '2'
---
    public function HapusBuku($data)
    {
        $this->db->table('tb_buku')->where('id', $data['id'])->delete($data);