app/Models/ModelKategori.php

    public function AllData()
    {
        return $this->db->table('tb_kategori')->orderBy('id', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `tb_kategori`
ORDER BY `id` DESC