app/Models/ModelPenulis.php

SELECT *
FROM `tb_penulis`
ORDER BY `id` DESC
---
    public function AllData()
    {
        return $this->db->table('tb_penulis')->orderBy('id', 'DESC')->get()->getResultArray();