app/Models/ModelPeminjaman.php

SELECT `tb_buku`.`id`, `tb_buku`.`judul`, `tb_user`.`id`, `tb_user`.`nama`, `tb_user`.`foto`, `tb_peminjam`.`tgl_pinjam`, `tb_peminjam`.`tgl_kembali`, `tb_peminjam`.`batas_waktu`, `tb_peminjam`.`id`, `tb_kategori`.`nama`, `tb_penulis`.`nama`, `tb_penerbit`.`nama`, `tb_buku`.`jumlah`, `tb_buku`.`lokasi`, `tb_buku`.`foto_buku`, `tb_peminjam`.`status`
FROM `tb_peminjam`
LEFT JOIN `tb_buku` ON `tb_buku`.`id` = `tb_peminjam`.`id_buku`
LEFT JOIN `tb_user` ON `tb_user`.`id` = `tb_peminjam`.`user_id`
LEFT JOIN `tb_penulis` ON `tb_penulis`.`id` = `tb_buku`.`penulis_id`
LEFT JOIN `tb_penerbit` ON `tb_penerbit`.`id` = `tb_buku`.`penerbit_id`
LEFT JOIN `tb_kategori` ON `tb_kategori`.`id` = `tb_buku`.`kategori_id`
WHERE `status` = 'Dipinjam'
OR `status` = 'Waiting'
---
    public function InfoPinjam()
    {
        return $this->db->table('tb_peminjam')
        ->join('tb_buku', 'tb_buku.id = tb_peminjam.id_buku', 'left')
        ->join('tb_user', 'tb_user.id = tb_peminjam.user_id', 'left')
        ->join('tb_penulis', 'tb_penulis.id = tb_buku.penulis_id', 'left')
        ->join('tb_penerbit', 'tb_penerbit.id = tb_buku.penerbit_id', 'left')
        ->join('tb_kategori', 'tb_kategori.id = tb_buku.kategori_id', 'left')
            ->where('status', 'Dipinjam' )
            ->orWhere('status', 'Waiting' )
            ->select('tb_buku.id,tb_buku.judul,tb_user.id,tb_user.nama,tb_user.foto,tb_peminjam.tgl_pinjam,tb_peminjam.tgl_kembali,tb_peminjam.batas_waktu,tb_peminjam.id,tb_kategori.nama,tb_penulis.nama,tb_penerbit.nama,tb_buku.jumlah,tb_buku.lokasi,tb_buku.foto_buku,tb_peminjam.status')
            ->get()
            ->getResultArray();

UPDATE `tb_peminjam` SET `id` = '13', `status` = 'Dikembalikan'
WHERE `id` = '13'
---
    public function EditTerlambat($id_pinjam, $data)
    {
        $this->db->table('tb_peminjam')->where('id', $id_pinjam)->update($data);