app/Models/ModelAnggota.php

SELECT *
FROM `tb_user`
WHERE `id` = '1'
---
    public function ProfileAnggota($id){
        return $this->db->table('tb_user')
            ->where('id',$id) ->get()->getRowArray();

UPDATE `tb_user` SET `id` = '1', `nama` = 'Sumi Sakurasawa', `jk` = 'perempuan', `telp` = '0895386490035', `alamat` = 'kuningan', `username` = 'susaku', `password` = 'istri refan', `foto` = '1715660766_c46fe5666dba8027e595.jpg'
WHERE `id` = '1'
---
    public function EditProfil($data)
    {
        $this->db->table('tb_user')
        ->where('id', $data['id'])
            ->update($data);

SELECT *
FROM `tb_user`
WHERE `id` = '1'
---
    public function DetailData($id_anggota){
        return $this->db->table('tb_user')
        ->where('id', $id_anggota)
        ->get()->getRowArray();

SELECT *
FROM `tb_user`
---
    public function AllData()
    {
        return $this->db->table('tb_user')
        ->get()->getResultArray();